In [1]:
import pandas as pd

## feed pd.read_csv() method a URL arguement

In [13]:
url = "https://data.cityofnewyork.us/api/views/ia2d-e54m/rows.csv"
water = pd.read_csv(url)
water.head()

,Year,New York City Population,NYC Consumption(Million gallons per day),Per Capita(Gallons per person per day)
0,1979,7102100.0,1512.0,213
1,1980,7071639.0,1506.0,213
2,1981,7089241.0,1309.0,185
3,1982,7109105.0,1382.0,194
4,1983,7181224.0,1424.0,198

### Quick Object Conversions

In [16]:
water['Year'].tolist()

[1979,
 1980,
 1981,
 1982,
 1983,
 1984,
 1985,
 1986,
 1987,
 1988,
 1989,
 1990,
 1991,
 1992,
 1993,
 1994,
 1995,
 1996,
 1997,
 1998,
 1999,
 2000,
 2001,
 2002,
 2003,
 2004,
 2005,
 2006,
 2007,
 2008,
 2009,
 2010,
 2011,
 2012,
 2013,
 2014,
 2015,
 2016,
 2017]

In [17]:
water['Year'].to_frame()

    Year
0   1979
1   1980
2   1981
3   1982
4   1983
5   1984
6   1985
7   1986
8   1987
9   1988
10  1989
11  1990
12  1991
13  1992
14  1993
15  1994
16  1995
17  1996
18  1997
19  1998
20  1999
21  2000
22  2001
23  2002
24  2003
25  2004
26  2005
27  2006
28  2007
29  2008
30  2009
31  2010
32  2011
33  2012
34  2013
35  2014
36  2015
37  2016
38  2017

In [22]:
water.columns

Index(['Year', 'New York City Population',
       'NYC Consumption(Million gallons per day)',
       'Per Capita(Gallons per person per day)'],
      dtype='object')

### Export to .csv file

In [23]:
# water.to_csv("Water Consumption in NY.csv")
# water.to_csv("Water Consumption in NY.csv", index=False) # it over writes above exported csv without index
water.to_csv("Water Consumption in NY.csv", index=False, columns=["Year", "New York City Population", "NYC Consumption(Million gallons per day)"]) #overwrites above exported csv
#with only given columns

## Import Excel File

In [24]:
df = pd.read_excel("Data - Single Worksheet.xlsx") #this is for excel sheet with only 1 sheet in it
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [26]:
df1 = pd.read_excel("Data - Multiple Worksheets.xlsx") # by default even in multi sheet excel it takes only 1st sheet and ignores other sheets even if its present
df1

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [27]:
df1 = pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name= 1) #sheet_name by default its 0 which indicates first sheet
df1

# sheet_name , either sheet name can be provided or which no of sheet to be read

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [33]:
# data = pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name= [0,1])
data = pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name= ["Data 1","Data 2"])

In [34]:
type(data)

collections.OrderedDict

In [35]:
data

OrderedDict([('Data 1',   First Name Last Name           City Gender
              0    Brandon     James          Miami      M
              1       Sean   Hawkins         Denver      M
              2       Judy       Day    Los Angeles      F
              3     Ashley      Ruiz  San Francisco      F
              4  Stephanie     Gomez       Portland      F),
             ('Data 2',   First Name Last Name           City Gender
              0     Parker     Power        Raleigh      F
              1    Preston  Prescott   Philadelphia      F
              2    Ronaldo   Donaldo         Bangor      M
              3      Megan   Stiller  San Francisco      M
              4     Bustin    Jieber         Austin      F)])

In [38]:
# data[0]
# data[1]
# data["Data 1"]
data["Data 2"]

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [40]:
multiple_datasheets = pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name= None) #sheet_name = None when we have multiple sheets inside a excel
multiple_datasheets

OrderedDict([('Data 1',   First Name Last Name           City Gender
              0    Brandon     James          Miami      M
              1       Sean   Hawkins         Denver      M
              2       Judy       Day    Los Angeles      F
              3     Ashley      Ruiz  San Francisco      F
              4  Stephanie     Gomez       Portland      F),
             ('Data 2',   First Name Last Name           City Gender
              0     Parker     Power        Raleigh      F
              1    Preston  Prescott   Philadelphia      F
              2    Ronaldo   Donaldo         Bangor      M
              3      Megan   Stiller  San Francisco      M
              4     Bustin    Jieber         Austin      F)])

## Export Excel File

In [41]:
url = "https://data.cityofnewyork.us/api/views/ia2d-e54m/rows.csv"
water = pd.read_csv(url)
water.head()

,Year,New York City Population,NYC Consumption(Million gallons per day),Per Capita(Gallons per person per day)
0,1979,7102100.0,1512.0,213
1,1980,7071639.0,1506.0,213
2,1981,7089241.0,1309.0,185
3,1982,7109105.0,1382.0,194
4,1983,7181224.0,1424.0,198

In [42]:
water["Year"].value_counts()

1983    1
1993    1
2000    1
1999    1
1998    1
1997    1
1996    1
1995    1
1994    1
1992    1
2002    1
1991    1
1990    1
1989    1
1988    1
1987    1
1986    1
1985    1
2001    1
2003    1
1982    1
2013    1
1981    1
1980    1
1979    1
2017    1
2016    1
2015    1
2014    1
2012    1
2004    1
2011    1
2010    1
2009    1
2008    1
2007    1
2006    1
2005    1
1984    1
Name: Year, dtype: int64

In [45]:
water_lt = water[water["Year"] < 1990]
water_gt = water[water["Year"] >= 1990]

In [46]:
excel_file = pd.ExcelWriter("Water by year.xlsx")

In [47]:
water_lt.to_excel(excel_file, sheet_name = "water lt 1990", index = False)
water_gt.to_excel(excel_file, sheet_name = "water gt 1990", index = False)

In [48]:
excel_file.save()